ðŸ“˜ Pandas GroupBy 
The groupby() function in Pandas is one of the most powerful tools for data analysis. It allows you to:

Split data into groups

Apply functions to each group

Combine the processed results

This approach enables efficient aggregation, transformation, and filtering of large datasets.

ðŸ”¹ The 3-Step GroupBy Process
1ï¸âƒ£ Split â†’ 2ï¸âƒ£ Apply â†’ 3ï¸âƒ£ Combine
STEP 1: Splitting Data into Groups

You can group data by one or more columns (keys).

1. Grouping by a Single Column
df.groupby('Name')
print(df.groupby('Name').groups)


This returns a dictionary where:

keys = unique values in the Name column

values = row indices belonging to each group

Example Output:
{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}


To see the first record from each group:

gk = df.groupby('Name')
gk.first()

2. Grouping by Multiple Columns
df.groupby(['Name', 'Qualification']).groups

Output Example:
('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ...


Each key is now a tuple representing a multi-column category.

3. Grouping with Sorted or Unsorted Keys

By default, keys are sorted:

df.groupby('Name')['Age'].sum()


To keep the original order:

df.groupby('Name', sort=False)['Age'].sum()

4. Grouping Using Object Attributes

Group values and their indices:

df.groupby('Name').groups

5. Iterating Through Groups
grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print()


Works for multiple keys as well.

6. Selecting a Single Group
grp = df.groupby('Name')
grp.get_group('Jai')


For multi-column groups:

grp = df.groupby(['Name', 'Qualification'])
grp.get_group(('Jai', 'Msc'))

STEP 2: Applying Functions to Groups

You can apply:

Aggregation

Transformation

Filtration

1. Aggregation
Simple Aggregation
grp1 = df.groupby('Name')
grp1['Age'].aggregate(np.sum)

Multiple Aggregations
grp['Age'].agg([np.sum, np.mean, np.std])

Aggregation with Multiple Group Keys
df.groupby(['Name', 'Qualification'])['Age'].aggregate(np.sum)

2. Transformation

This performs group-wise calculations but returns output with the same shape as the original dataset.

Example: Standardizing values inside each group

sc = lambda x: (x - x.mean()) / x.std()
grp2 = df2.groupby('Name')
grp2['Age'].transform(sc)


Useful for:

Normalization within groups

Filling missing values group-wise

Creating new transformed features

3. Filtration

Filter out groups that donâ€™t meet a condition.

Example: Keep groups with at least 2 records:

grp2 = df2.groupby('Name')
grp2.filter(lambda x: len(x) >= 2)

STEP 3: Combining Results

After applying functions, results are returned as DataFrames or Series.

Example: Summarizing by group

df.groupby('Name').agg({'Age': 'sum'})

ðŸ“Œ Why GroupBy Is Important?

Efficiently handles large datasets

Helps compute summary statistics

Enables group-wise transformation

Useful for segmentation analysis

GroupBy is essential for:

âœ” Data cleaning
âœ” Exploratory data analysis
âœ” Machine learning preprocessing
âœ” Reporting and summarization

In [22]:
#Pandas groupby

import pandas as pd

data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
df = pd.DataFrame(data1)
print(df)


df.groupby('Name')
print(df.groupby('Name').groups)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA
{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [23]:
#now we can print fiest entries in all grp formed
gk = df.groupby('Name')
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [24]:
# Grouping data wt multiplr keys
df.groupby(['Name', 'Qualification'])
print(df.groupby(['Name', 'Qualification']).groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [25]:
# grping data by sorting keys
df.groupby('Name')['Age'].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [26]:
#Now we apply groupby() without using sort(we pass sort=False).
df.groupby('Name', sort=False)['Age'].sum()

Name
Jai       49
Anuj      60
Princi    59
Gaurav    33
Abhi      32
Name: Age, dtype: int64

In [27]:
#Grouping data with object attributes
df.groupby('Name').groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [ ]:
# The dict is the result of df.groupby('Name').groups
# - Keys: unique values from the "Name" column ('Abhi', 'Anuj', ...)
# - Values: lists of DataFrame index positions (row labels) that belong to each group
# Example meanings:
#   'Anuj': [1, 5]  -> rows with index 1 and 5 in df have Name == 'Anuj'
#   'Abhi': [7]     -> row index 7 in df has Name == 'Abhi'
#
# To view the actual rows for a group (df and gk are defined in the notebook):
df.loc[gk.groups['Anuj']]
# or
gk.get_group('Anuj')

In [28]:
# Iterating through groups
grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)    
    print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [29]:
#Now we iterate an element of group containing multiple keys.
grp = df.groupby(['Name', 'Qualification'])
for name, group in grp:
    print(name)
    print(group)
    print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

 Selecting a group: In order to select a group, we can select group using GroupBy.get_group(). We can select a group by applying a function GroupBy.get_group this function select a single group.

In [30]:
grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [31]:
#we select an object grouped on multiple columns.
grp = df.groupby(['Name', 'Qualification'])
grp.get_group(('Anuj', 'MA'))

   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

Applying Functions to Groups
 Aggregation: It allows us to find a summary statistic for each group like summing or averaging values.

In [32]:
grp1 = df.groupby('Name')
grp1['Age'].aggregate(np.sum)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\4113814000.py:2: FutureWarning: The provided callable <function sum at 0x00000246BDDC4DC0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp1['Age'].aggregate(np.sum)

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [33]:
import numpy as np

# Use the existing grp1 defined earlier in the notebook
print(grp1['Age'].aggregate(np.sum))
# Alternative without numpy:
# print(grp1['Age'].sum())

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\1473600403.py:4: FutureWarning: The provided callable <function sum at 0x00000246BDDC4DC0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  print(grp1['Age'].aggregate(np.sum))

In [34]:
grp1 = df.groupby('Name')
grp1['Age'].aggregate(np.sum)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\4113814000.py:2: FutureWarning: The provided callable <function sum at 0x00000246BDDC4DC0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp1['Age'].aggregate(np.sum)

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [35]:
#aggregation on a group containing multiple keys. 
grp1 = df.groupby(['Name', 'Qualification'])
grp1['Age'].aggregate(np.sum)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\4063986818.py:3: FutureWarning: The provided callable <function sum at 0x00000246BDDC4DC0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp1['Age'].aggregate(np.sum)

Name    Qualification
Abhi    MA               32
Anuj    B.com            36
        MA               24
Gaurav  B.Tech           33
Jai     MCA              22
        Msc              27
Princi  Msc              27
        Phd              32
Name: Age, dtype: int64

 we can apply a multiple functions at once by passing a list or dictionary of functions.

In [36]:
grp = df.groupby('Name')
grp['Age'].agg([np.sum, np.mean, np.std])

C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\3832254242.py:2: FutureWarning: The provided callable <function sum at 0x00000246BDDC4DC0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp['Age'].agg([np.sum, np.mean, np.std])
C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\3832254242.py:2: FutureWarning: The provided callable <function mean at 0x00000246BDDC5FC0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  grp['Age'].agg([np.sum, np.mean, np.std])
C:\Users\ASUS\AppData\Local\Temp\ipykernel_9044\3832254242.py:2: FutureWarning: The provided callable <function std at 0x00000246BDDC60E0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

2. Transformation: It is a process in which we perform some group-specific computations and return a result with the same index as the original data.

In [38]:
# create df2 from the existing data2 dict and run the group-wise transform
df2 = pd.DataFrame(data2)

grp2 = df2.groupby('Name')
sc = lambda x: (x - x.mean()) / x.std()
df2['Age_std_by_name'] = grp2['Age'].transform(sc)

print(df2[['Name', 'Age', 'Age_std_by_name']])

     Name  Age  Age_std_by_name
0     Jai   27         0.707107
1    Anuj   24              NaN
2     Jai   22        -0.707107
3  Princi   32              NaN
4  Gaurav   33              NaN
5    Anuj   24              NaN
6  Princi   32              NaN
7    Abhi   27              NaN

In [39]:
import pandas as pd
data2 = {'Name' : ['Jai', 'Anuj', 'Jai', 'Princi', 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
         'Age' : [27, 24, 22, 32, 33, 24, 32, 27],
         'Address' : ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
         'Qualification' : ['MSc', 'MA', 'MSc', 'PhD', 'MA', 'MA', 'PhD', 'MSc'],
         'Score' : [23, 22, 24, 32, 33, 22, 32, 27]}
grp2 = df2.groupby('Name')
sc = lambda x: (x - x.mean()) / x.std()
grp2['Age'].transform(sc)

0    0.707107
1         NaN
2   -0.707107
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
Name: Age, dtype: float64

In [40]:
import pandas as pd
data2 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA'],
        'Score':[23, 34, 35, 45, 47, 50, 52, 53]} 
grp2 = df2.groupby('Name')
sc = lambda x: (x - x.mean()) / x.std() 
grp2['Age'].transform(sc)

0    0.707107
1         NaN
2   -0.707107
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
Name: Age, dtype: float64

3. Filtration: It is a process which is used to discard groups based on a condition. For example we can filter out groups where the number of records is less than a certain threshold.

In [41]:
grp2 = df2.groupby('Name')
grp2.filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification  Score  Age_std_by_name
0     Jai   27     Nagpur           MSc     23         0.707107
1    Anuj   24     Kanpur            MA     22              NaN
2     Jai   22  Allahabad           MSc     24        -0.707107
3  Princi   32    Kannuaj           PhD     32              NaN
5    Anuj   24     Kanpur            MA     22              NaN
6  Princi   32  Allahabad           PhD     32              NaN

Combining Results :- 

After applying the functions, results are combined back into a data structure like a DataFrame or Series. We can further analyze or visualize the data in its new form.

In [42]:
df.groupby('Name').agg({'Age': 'sum'})

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59